# Lx Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Lx Property
SymbolTypeId Class See Also
---
Symbol lx, indicating unit Lux.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Lx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Lx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Lx {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace